In [25]:
import pandas as pd

In [26]:
df = pd.read_csv("/Users/roman2006/PycharmProjects/Liana Clone/Session_1/file_formats/simplefile.csv", 
                 names=['Name','Age','Country'],skiprows=1)

In [27]:
df.head()

    Name   Age        Country
0   John  30.0  North America
1  Maria  25.0         Europe
2   Chet  22.0           Asia
3   Joan   NaN         Europe

In [28]:
df[["Name",'Age']].min()

Name    Chet
Age       22
dtype: object

In [29]:
df.isnull().sum()

Name       0
Age        1
Country    0
dtype: int64

In [30]:
df.dropna(subset = ['Age'])

    Name   Age        Country
0   John  30.0  North America
1  Maria  25.0         Europe
2   Chet  22.0           Asia

In [31]:
df["Age"]

0    30.0
1    25.0
2    22.0
3     NaN
Name: Age, dtype: float64

In [32]:
import datetime
year = datetime.datetime.now().year
df["Birthday"] = df.apply(lambda row: year-row["Age"],axis=1)

In [35]:
df.head()

    Name   Age        Country  Birthday
0   John  30.0  North America    1987.0
1  Maria  25.0         Europe    1992.0
2   Chet  22.0           Asia    1995.0
3   Joan   NaN         Europe       NaN